test_like_a_hero/app/controllers/enemies_controller.rb

  def update
    if @enemy.update(enemy_params)
---
UPDATE "enemies" SET "name" = ?, "level" = ?, "power_base" = ?, "power_step" = ?, "kind" = ?, "updated_at" = ? WHERE "enemies"."id" = ?  [["name", "harum"], ["level", 23], ["power_base", 2928], ["power_step", 222], ["kind", 0], ["updated_at", "2020-12-10 14:31:55.061412"], ["id", 1]]

  def destroy
    @enemy.destroy
---
DELETE FROM "enemies" WHERE "enemies"."id" = ?  [["id", 1]]

    def set_enemy
      @enemy = Enemy.find(params[:id])
---
SELECT  "enemies".* FROM "enemies" WHERE "enemies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]