test_like_a_hero/app/controllers/weapons_controller.rb

  def index
    @weapons = Weapon.all
---
SELECT "weapons".* FROM "weapons"

  def create
    @weapon = Weapon.create(weapon_params)
---
INSERT INTO "weapons" ("created_at", "updated_at", "name", "level", "power_base", "power_step") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2020-12-10 13:54:03.378934"], ["updated_at", "2020-12-10 13:54:03.378934"], ["name", "Rolanda"], ["level", 91], ["power_base", 1872], ["power_step", 110]]

  def destroy
    @weapon.destroy
---
DELETE FROM "weapons" WHERE "weapons"."id" = ?  [["id", 1]]

    def set_weapon
      @weapon = Weapon.find(params[:id])
---
SELECT  "weapons".* FROM "weapons" WHERE "weapons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]